performance-test-reports/automated-security-tests/12617145617/1/user-login/user_login/run.log
-    █ setup

-      █ Given Multiple Users Can access the system

-    █ And [Auth Service] Login Endpoint is accessible

-      █ When more than 10 users are trying to login at the same time

-        ✓ test start time : 2025-01-05T06:15:06Z
-        ✓ request url : http://localhost:5500/client_login
-        ✗ response status : 200
-         ↳  98% — ✓ 336964 / ✗ 6558
-        ✓ response: isJson
-        ✓ Mock N/A
-        ✓ response error : none
-        ✗ response error : 
		status-->0
		error-->read: connection reset by peer
-         ↳  0% — ✓ 0 / ✗ 1993
-        ✗ response error : 
		status-->0
		error-->dial: i/o timeout
-         ↳  0% — ✓ 0 / ✗ 1224
-        ✗ response error : 
		status-->0
		error-->request timeout
-         ↳  0% — ✓ 0 / ✗ 3341

-      █ Then the system should be able to handle the load and respond with status 200

-        ✗ expected response status to equal 200
-         ↳  98% — ✓ 336964 / ✗ 6558
-        ✓ has valid json body
-        ✓ expected user login api auth token not to be null

-      █ And verify the load test client should find the breaking point

-        ✗ expected response status to equal 200
-         ↳  98% — ✓ 336964 / ✗ 6558
-        ✓ has valid json body
-        ✓ expected user login api auth token not to be null

-    _response_errors_cnt...........: 6558    7.392333/s
-    _response_success_cnt..........: 336964  379.833794/s
-    _response_total_cnt............: 343522  387.226127/s
-    checks.........................: 99.35%  ✓ 4069800     ✗ 26232 
-    data_received..................: 120 MB  136 kB/s
-    data_sent......................: 81 MB   91 kB/s
-    dropped_iterations.............: 1618507 1824.419389/s
-    group_duration.................: avg=893.06ms min=238.77µs med=2.3ms    max=1m0s     p(90)=1.26s    p(95)=2.48s   
-    http_req_blocked...............: avg=457.3ms  min=0s       med=169.28µs max=19.58s   p(90)=1.02s    p(95)=2.05s   
-    http_req_connecting............: avg=457.25ms min=0s       med=131.44µs max=19.58s   p(90)=1.02s    p(95)=2.05s   
-  ✗ http_req_duration..............: avg=1.21s    min=0s       med=245.21ms max=1m0s     p(90)=729.43ms p(95)=1.46s   
-      { expected_response:true }...: avg=516.86ms min=819.16µs med=244.85ms max=58.16s   p(90)=643.16ms p(95)=1.17s   
-  ✗ http_req_failed................: 1.90%   ✓ 6558        ✗ 336964
-    http_req_receiving.............: avg=446.34µs min=0s       med=77.44µs  max=121.2ms  p(90)=1.01ms   p(95)=1.83ms  
-    http_req_sending...............: avg=169.18µs min=0s       med=32.02µs  max=127.44ms p(90)=141.38µs p(95)=264.78µs
-    http_req_tls_handshaking.......: avg=0s       min=0s       med=0s       max=0s       p(90)=0s       p(95)=0s      
-    http_req_waiting...............: avg=1.21s    min=0s       med=244.67ms max=1m0s     p(90)=728.3ms  p(95)=1.46s   
-    http_reqs......................: 343522  387.226127/s
-    iteration_duration.............: avg=1.78s    min=2.76ms   med=252.2ms  max=1m0s     p(90)=2.48s    p(95)=5.09s   
-    iterations.....................: 343522  387.226127/s
-    vus............................: 1       min=0         max=1000
-    vus_max........................: 1000    min=392       max=1000